In [1]:
import pandas as pd
import seaborn as sns
import numpy as np

In [2]:
url = "https://raw.githubusercontent.com/shivang98/Social-Network-ads-Boost/master/Social_Network_Ads.csv"
df = pd.read_csv(url)

In [3]:
df

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510    Male   19            19000          0
1    15810944    Male   35            20000          0
2    15668575  Female   26            43000          0
3    15603246  Female   27            57000          0
4    15804002    Male   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

[400 rows x 5 columns]

In [4]:
df = df.iloc[:, 1:]

In [5]:
df

     Gender  Age  EstimatedSalary  Purchased
0      Male   19            19000          0
1      Male   35            20000          0
2    Female   26            43000          0
3    Female   27            57000          0
4      Male   19            76000          0
..      ...  ...              ...        ...
395  Female   46            41000          1
396    Male   51            23000          1
397  Female   50            20000          1
398    Male   36            33000          0
399  Female   49            36000          1

[400 rows x 4 columns]

In [6]:
df = pd.concat([df, pd.get_dummies(df["Gender"], drop_first=True)], axis = 1)

In [7]:
df

     Gender  Age  EstimatedSalary  Purchased  Male
0      Male   19            19000          0     1
1      Male   35            20000          0     1
2    Female   26            43000          0     0
3    Female   27            57000          0     0
4      Male   19            76000          0     1
..      ...  ...              ...        ...   ...
395  Female   46            41000          1     0
396    Male   51            23000          1     1
397  Female   50            20000          1     0
398    Male   36            33000          0     1
399  Female   49            36000          1     0

[400 rows x 5 columns]

In [8]:
df.drop("Gender", axis=1)

     Age  EstimatedSalary  Purchased  Male
0     19            19000          0     1
1     35            20000          0     1
2     26            43000          0     0
3     27            57000          0     0
4     19            76000          0     1
..   ...              ...        ...   ...
395   46            41000          1     0
396   51            23000          1     1
397   50            20000          1     0
398   36            33000          0     1
399   49            36000          1     0

[400 rows x 4 columns]

In [9]:
X = df[["Age", "EstimatedSalary", "Male"]]

In [10]:
from sklearn.preprocessing import StandardScaler
sc = StandardScaler()
X = sc.fit_transform(X)

In [11]:
Y = df["Purchased"]
Y

0      0
1      0
2      0
3      0
4      0
      ..
395    1
396    1
397    1
398    0
399    1
Name: Purchased, Length: 400, dtype: int64

In [12]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(X, Y, test_size=0.2, random_state = 0)

In [13]:
from sklearn.linear_model import LogisticRegression
lr = LogisticRegression()
lr.fit(x_train, y_train)

LogisticRegression()

In [14]:
lr.score(x_test, y_test)

0.9125

In [15]:
from sklearn.metrics import accuracy_score
accuracy_score(y_test, lr.predict(x_test))

0.9125

from sklearn.metrics import confusion_matrix

cm = confusion_matrix(y_true=y_test, y_pred=lr.predict(x_test))
cm

In [16]:
from sklearn.metrics import confusion_matrix

cm = confusion_matrix(y_true=y_test, y_pred=lr.predict(x_test)) 
cm

array([[56,  2],
       [ 5, 17]])

Predicted(row) | Actual(col)

True => model prediction is right
False => model prediction is wrong
Postive => model has accepted

In [18]:
tp = cm[0][0]
fp = cm[0][1]
fn = cm[1][0]
tn = cm[1][1]

In [20]:
# Accuracy of prediction

'''
 Acc = number of correct pred / total predictions
 Correct? = i.e. predicted and actual is true (whether appected/rejected)
'''

acc = (tp + tn)/(tp + fp + tn + fn)
acc

0.9125

In [22]:
# Error rate

'''
 Err = number of incorrect pred / total predictions
 Incorrect? = i.e. predicted and actual is contradictory (whether appected/rejected)
'''


err = (fp + fn)/(tp + fp + tn + fn)
err

# OR
# err = 1 - acc

0.0875

In [28]:
# Precision

'''
 Also called => confidence value
 Presn = number of correct accepted (positive) / total positive predictions
'''

presn = (tp)/(tp + fp)
presn

0.9655172413793104

In [29]:
# Recall

'''
 Recall = model correctly predicts positively / (model correctly predicts positively + model ignores the actual
                                                 true h0.150 rows × 5 columns

In [7]:
￼
X = df[["sepal_length", "sepal_width", "petal_length", "petal_width"]]
Y = df["species"]
In [13]:
￼

                                                 ) 
 Correct? = i.e. predicted and actual is true (whether appected/rejected)
'''

recall = (tp)/(tp + fn)
recall

0.9180327868852459

In [ ]:
'''

True | False => model prediction is correct or wrong

Positve | Negative => h0 is true or false

'''